phytec/optee_os-phytec-stm32mp/core/arch/arm/plat-stm32mp1/scmi_server.c
	if (channel_id >= max_id)
		return NULL;

	return find_resource(confined_id)->channel;
}

static uint8_t *plat_protocol_list;
static size_t plat_protocol_list_count;

static void add_protocol(uint8_t protocol_id)
{
	plat_protocol_list_count++;

	plat_protocol_list = realloc(plat_protocol_list,
				     plat_protocol_list_count *
				     sizeof(*plat_protocol_list));
	assert(plat_protocol_list);

	plat_protocol_list[plat_protocol_list_count - 1] = protocol_id;
}

static void plat_scmi_set_protocol_list(void)
{
	unsigned int n = 0;
	const size_t channel_count = ARRAY_SIZE(scmi_channel);

	if (plat_protocol_list_count)
		return;

	for (n = 0; n < channel_count; n++)
		if (scmi_channel[n].clock_count)
			break;
	if (n < channel_count)
		add_protocol(SCMI_PROTOCOL_ID_CLOCK);

	for (n = 0; n < channel_count; n++)
		if (scmi_channel[n].rd_count)
			break;
	if (n < channel_count)
		add_protocol(SCMI_PROTOCOL_ID_RESET_DOMAIN);

	for (n = 0; n < channel_count; n++)
		if (IS_ENABLED(CFG_SCMI_MSG_REGULATOR_CONSUMER) &&
		    plat_scmi_voltd_count(n))
			break;
	if (n < channel_count)
		add_protocol(SCMI_PROTOCOL_ID_VOLTAGE_DOMAIN);

#ifdef CFG_SCMI_MSG_PERF_DOMAIN
	for (n = 0; n < channel_count; n++)
		if (scmi_channel[n].perfd_count)
			break;
	if (n < channel_count)
		add_protocol(SCMI_PROTOCOL_ID_PERF);
#endif

	/* The array expects a terminal 0 ID value */
	add_protocol(0);
}

static const char vendor[] = "ST";
static const char sub_vendor[] = "";

const char *plat_scmi_vendor_name(void)
{
	return vendor;
}

const char *plat_scmi_sub_vendor_name(void)
{
	return sub_vendor;
}

size_t plat_scmi_protocol_count(void)
{
	plat_scmi_set_protocol_list();
	assert(plat_protocol_list_count);

	return plat_protocol_list_count - 1;
}

const uint8_t *plat_scmi_protocol_list(unsigned int channel_id __unused)
{
	return plat_protocol_list;
}

static bool nsec_can_access_resource(unsigned int etzpc_id)
{
	static struct firewall_controller *etzpc_fw_ctrl;
	uint32_t query_arg = DECPROT(etzpc_id, DECPROT_NS_RW, DECPROT_UNLOCK);
	struct firewall_query query = {
		.arg_count = 1,
		.args = &query_arg,
		.ctrl = etzpc_fw_ctrl,
	};

	if (etzpc_id == ETZPC_ID_NEVER_ACCESSIBLE)
		return false;
	if (etzpc_id == ETZPC_ID_ALWAYS_ACCESSIBLE)
		return true;

	if (!etzpc_fw_ctrl) {
		struct dt_driver_provider *prov = NULL;
		int node = 0;

		node = fdt_node_offset_by_compatible(get_embedded_dt(), -1,
						     "st,stm32-etzpc");
		if (node < 0)
			panic();

		prov = dt_driver_get_provider_by_node(node, DT_DRIVER_FIREWALL);
		if (!prov)
			panic();

		etzpc_fw_ctrl = dt_driver_provider_priv_data(prov);
		query.ctrl = etzpc_fw_ctrl;
	}

	return firewall_check_access(&query) == TEE_SUCCESS;
}

/*
 * Platform SCMI clocks
 */
static struct stm32_scmi_clk *find_clock(unsigned int channel_id,
					 unsigned int scmi_id)
{
	const struct channel_resources *resource = find_resource(channel_id);

	if (resource && scmi_id < resource->clock_count)
		return &resource->clock[scmi_id];

	return NULL;
}

size_t plat_scmi_clock_count(unsigned int channel_id)
{
	const struct channel_resources *resource = find_resource(channel_id);

	if (!resource)
		return 0;

	return resource->clock_count;
}

const char *plat_scmi_clock_get_name(unsigned int channel_id,
				     unsigned int scmi_id)
{
	struct stm32_scmi_clk *clock = find_clock(channel_id, scmi_id);

	if (!clock || !nsec_can_access_resource(clock->etzpc_id))
		return NULL;

	return clock->name;
}

int32_t plat_scmi_clock_rates_array(unsigned int channel_id,
				    unsigned int scmi_id, size_t start_index,
				    unsigned long *array, size_t *nb_elts)
{
	/*
	 * Be warned that Linux kernel as of v5.4.24 may not fully support
	 * clock rates by array description.
	 */
	struct stm32_scmi_clk *clock = find_clock(channel_id, scmi_id);
	TEE_Result __maybe_unused res = TEE_ERROR_GENERIC;

	assert(nb_elts && (!*nb_elts || array));

	if (!clock)
		return SCMI_NOT_FOUND;

	if (!nsec_can_access_resource(clock->etzpc_id))
		return SCMI_DENIED;

	switch (scmi_id) {
	case CK_SCMI_MPU:
		/* MPU clock shall use plat_scmi_clock_rates_by_step() */
		return SCMI_NOT_SUPPORTED;
#ifdef CFG_STM32MP13
	case CK_SCMI_PLL4_Q:
		res = clk_get_rates_array(clock->clk, start_index, array,
					  nb_elts);
		if (res == TEE_ERROR_NOT_SUPPORTED)
			return SCMI_NOT_SUPPORTED;
		if (res)
			return SCMI_GENERIC_ERROR;
		return SCMI_SUCCESS;
#endif
	default:
		if (start_index)
			return SCMI_INVALID_PARAMETERS;
		if (*nb_elts)
			*array = clk_get_rate(clock->clk);
		*nb_elts = 1;

		return SCMI_SUCCESS;
	}
}

int32_t plat_scmi_clock_rates_by_step(unsigned int channel_id,
				      unsigned int scmi_id,
				      unsigned long *array)
{
	struct stm32_scmi_clk *clock = find_clock(channel_id, scmi_id);

	if (!clock)
		return SCMI_NOT_FOUND;

	if (!nsec_can_access_resource(clock->etzpc_id))
		return SCMI_DENIED;

	switch (scmi_id) {
	case CK_SCMI_MPU:
		/*
		 * Pretend we support all rates for MPU clock,
		 * CLOCK_RATE_SET will reject unsupported rates.
		 */
		array[0] = 0U;
		array[1] = UINT32_MAX;
		array[2] = 1U;
		return SCMI_SUCCESS;
	default:
		return SCMI_NOT_SUPPORTED;
	}
}

int32_t plat_scmi_clock_set_rate(unsigned int channel_id, unsigned int scmi_id,
				 unsigned long rate)
{
	struct stm32_scmi_clk *clock = find_clock(channel_id, scmi_id);

	if (!clock)
		return SCMI_NOT_FOUND;

	if (!nsec_can_access_resource(clock->etzpc_id))
		return SCMI_DENIED;

	switch (scmi_id) {
#if defined(CFG_STM32MP15) && defined(CFG_STM32_CPU_OPP)
	case CK_SCMI_MPU:
		if (stm32mp1_set_opp_khz(rate / 1000))
			return SCMI_INVALID_PARAMETERS;
		break;
#endif
#ifdef CFG_STM32MP13
	case CK_SCMI_PLL4_Q:
		if (clk_set_rate(clock->clk, rate))
			return SCMI_INVALID_PARAMETERS;
		break;
#endif
	default:
		if (rate != clk_get_rate(clock->clk))
			return SCMI_INVALID_PARAMETERS;
		break;
	}

	return SCMI_SUCCESS;
}

unsigned long plat_scmi_clock_get_rate(unsigned int channel_id,
				       unsigned int scmi_id)
{
	struct stm32_scmi_clk *clock = find_clock(channel_id, scmi_id);

	if (!clock || !nsec_can_access_resource(clock->etzpc_id))
		return 0;

	return clk_get_rate(clock->clk);
}

unsigned long plat_scmi_clock_round_rate(unsigned int channel_id,
					 unsigned int scmi_id,
					 unsigned long rate)
{
	struct stm32_scmi_clk *clock = find_clock(channel_id, scmi_id);

	if (!clock || !nsec_can_access_resource(clock->etzpc_id))
		return 0;

